app/views/users/index.html.erb

      <td><%= user.email %></td>
      <% if user.relationships.where(friend_id: current_user.id, status: "pending").count > 0 %>
---
SELECT "relationships".* FROM "relationships" WHERE "relationships"."user_id" = $1 AND "relationships"."friend_id" = $2  [["user_id", 12], ["friend_id", 2]]
SELECT COUNT(*) FROM "relationships" WHERE "relationships"."user_id" = $1 AND "relationships"."friend_id" = $2 AND "relationships"."status" = $3  [["user_id", 1], ["friend_id", 12], ["status", "pending"]]